# TotalConnectedCurrent Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalTransferSwitchData..::..TotalConnectedCurrent Property
AnalyticalTransferSwitchData Class See Also
---
The total connected current of the electrical analytical transfer switch.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double TotalConnectedCurrent { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalConnectedCurrent As Double
	Get
```

Visual C++
---
```text
public:
property double TotalConnectedCurrent {
	double get ();
}
```

# See Also
AnalyticalTransferSwitchData Class
Autodesk.Revit.DB.Electrical Namespace